[
  {
    "id": "9084986f-456c-449b-ae6e-59ef1f26b129",
    "title": "CSS in Depth",
    "author": "Keith J. Grant",
    "genre": "Web Development",
    "rating": 4,
    "coverUrl": "https://images.unsplash.com/photo-1618401471353-b98afee0b2eb?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8Y3NzJTIwYm9va3xlbnwwfHwwfHx8MA%3D%3D",
    "coverColor": "#1e2a4b",
    "description": "CSS in Depth by Keith J. Grant is a comprehensive guide for web developers who want to go beyond the basics of CSS and master the intricacies of styling web pages. The book is designed for intermediate to advanced developers who are already familiar with CSS but want to deepen their understanding and leverage its full potential.",
    "totalCopies": 18,
    "availableCopies": 16,
    "videoUrl": "https://www.youtube.com/watch?v=1PnVor36_40",
    "summary": "CSS in Depth starts by reviewing the basic principles of CSS, then quickly moves on to more advanced concepts. Grant emphasizes the importance of understanding the underlying mechanics of CSS properties like layout, box model, and positioning. Readers learn how to use these tools more effectively, making their code more predictable and easier to debug.\n\nThe book dedicates significant time to discussing modern layout systems, especially Flexbox and CSS Grid. These powerful tools enable developers to create complex, responsive designs with minimal code. Grant explains how to use them in different contexts, providing practical examples of when and why they are useful.\n\nOne of the book’s highlights is its in-depth coverage of animations and transitions. Readers learn how to add dynamic effects to their web pages without relying on JavaScript. This is especially useful for creating smooth, interactive designs that improve user experience.\n\nThe book also discusses CSS preprocessors and methodologies like BEM (Block Element Modifier), teaching developers how to structure their stylesheets for larger projects. Grant encourages best practices such as keeping CSS DRY (Don’t Repeat Yourself) and modularizing code.\n\nBy the end of the book, readers will have the knowledge and confidence to tackle complex CSS challenges and create stunning web interfaces with efficiency and elegance."
  },
  {
    "id": "350c3bc8-a5cc-45a3-ba16-97b93ed056b0",
    "title": "HTML and CSS: Design and Build Websites",
    "author": "Jon Duckett",
    "genre": "Web Development",
    "rating": 5,
    "coverUrl": "https://images.unsplash.com/photo-1541963463532-d68292c34b19?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8aHRtbCUyMGNzc3xlbnwwfHwwfHx8MA%3D%3D",
    "coverColor": "#3a2931",
    "description": "Whether you’re a complete beginner or someone looking to brush up on HTML and CSS, this book provides a solid foundation and practical skills that can be applied immediately to real-world projects.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://www.youtube.com/watch?v=UB1O30fR-EE",
    "summary": "HTML and CSS: Design and Build Websites starts with an introduction to HTML, covering the basic building blocks of a webpage, including elements like headings, paragraphs, links, and images. Duckett carefully explains the structure and syntax of HTML, teaching readers how to write and organize their code.\n\nThe book then transitions to CSS, showing readers how to apply styles to their HTML elements. Topics such as fonts, colors, borders, padding, and margins are introduced in clear, easy-to-understand terms. Duckett uses plenty of visual examples to help readers see the immediate impact of the styles they apply.\n\nAs the book progresses, readers dive deeper into layout techniques, learning about the box model, positioning, floats, and flexible layouts with CSS Flexbox. The concept of responsive design is also covered, teaching readers how to make their websites adapt to different screen sizes and devices.\n\nThroughout, the book is full of practical tips and techniques to create beautiful, functional websites. Duckett’s clear explanations and colorful layout make complex topics easier to understand, making this book a perfect guide for anyone starting their web development journey."
  },
  {
    "id": "b514f922-a715-45ec-846e-e51d40e15aa2",
    "title": "System Design Interview",
    "author": "Alex Xu",
    "genre": "System Design",
    "rating": 5,
    "coverUrl": "https://images.unsplash.com/photo-1616587894289-86480e533129?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8c3lzdGVtJTIwZGVzaWdufGVufDB8fDB8fHww",
    "coverColor": "#363b63",
    "description": "System Design Interview: An Insider's Guide by Alex Xu is a must-read for software engineers and professionals preparing for system design interviews. The book provides a detailed overview of the principles and techniques needed to excel in system design interviews, which are often a key part of the hiring process at top tech companies.",
    "totalCopies": 10,
    "availableCopies": 10,
    "videoUrl": "https://www.youtube.com/watch?v=ZgdS0EUmn70",
    "summary": "System Design Interview: An Insider's Guide begins by introducing the key concepts of system design, emphasizing the importance of understanding requirements, scalability, and reliability. Xu explains how to approach an open-ended problem by breaking it down into smaller, manageable components, ensuring a structured response.\n\nThe book covers essential topics, such as database design, caching, load balancing, and message queues, explaining their relevance in building scalable and fault-tolerant systems. Xu also delves into the intricacies of designing high-availability systems, explaining concepts like replication, partitioning, and sharding.\n\nReaders are guided through various real-world system design problems, from designing a URL shortening service to building a recommendation system. Each example provides a deep dive into the trade-offs involved, offering valuable insights into how to optimize systems for performance, cost, and maintainability.\n\nXu also emphasizes the importance of communication during system design interviews, teaching readers how to present their solutions clearly and justify their decisions. With practice problems and tips on handling tough interview questions, the book is an essential resource for anyone looking to ace a system design interview."
  },
  {
    "id": "b4ed06bf-02b2-42c4-8886-b3847af02cca",
    "title": "Computer Science Distilled",
    "author": "Wladston Ferreira Filho",
    "genre": "Computer Science",
    "rating": 5,
    "coverUrl": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8Y29tcHV0ZXIlMjBzY2llbmNlfGVufDB8fDB8fHww",
    "coverColor": "#73d173",
    "description": "Computer Science Distilled by Wladston Ferreira Filho is a concise and approachable introduction to the core concepts of computer science. Designed for beginners and those looking to strengthen their problem-solving skills, the book breaks down complex topics into digestible, easy-to-understand pieces.",
    "totalCopies": 89,
    "availableCopies": 87,
    "videoUrl": "https://www.youtube.com/watch?v=-uleG_Vecis",
    "summary": "Computer Science Distilled begins by explaining the art of problem-solving in computing, emphasizing the importance of breaking down problems into manageable parts. It introduces key computational concepts such as abstraction, algorithms, and complexity analysis, providing a strong foundation for tackling any programming challenge.\n\nThe book explores data structures, including arrays, linked lists, stacks, queues, and trees, with clear explanations and visual aids to make these abstract concepts tangible. Readers learn how to select the right data structure for different scenarios, enhancing the efficiency of their solutions.\n\nLogical reasoning and algorithm design are central themes. The author delves into sorting, searching, and recursion, presenting these topics in an accessible way. He also highlights the importance of trade-offs in algorithm design, such as time versus space complexity.\n\nLater chapters focus on practical problem-solving techniques, encouraging readers to approach challenges creatively while maintaining computational efficiency. The book includes exercises to reinforce learning, making it highly interactive.\n\nBy the end, readers gain a solid grasp of computer science fundamentals, enabling them to write better programs and think like problem solvers. Its concise format ensures clarity and retention without overwhelming the reader."
  },
  {
    "id": "dc73abc1-8699-4e0a-91b0-a67e80292b9c",
    "title": "The Art of Assembly Language",
    "author": "Randall Hyde",
    "genre": "Programming",
    "rating": 3,
    "coverUrl": "https://images.unsplash.com/photo-1610563166150-b34df4f3bcd6?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8YXNzZW1ibHklMjBsYW5ndWFnZXxlbnwwfHwwfHx8MA%3D%3D",
    "coverColor": "#fff9bf",
    "description": "The Art of Assembly Language by Randall Hyde is a comprehensive and engaging introduction to assembly language programming. Known for its clarity and depth, the book provides readers with a solid foundation in low-level programming concepts, which are essential for understanding how computers operate at their core.",
    "totalCopies": 78,
    "availableCopies": 78,
    "videoUrl": "https://www.youtube.com/watch?v=4gwYkEK0gOk",
    "summary": "The Art of Assembly Language introduces readers to the fundamentals of assembly programming, beginning with an overview of computer architecture. It explains how CPUs process instructions and manage data, providing the necessary background to appreciate the power of assembly language.\n\nThe book then transitions into practical programming, starting with data representation and memory management. Readers learn how integers, floating-point numbers, and other data types are stored and manipulated at the binary level. Hyde uses HLA as a bridge, making assembly language concepts easier to grasp while maintaining a focus on the underlying principles.\n\nControl structures, including loops, conditionals, and functions, are explained in detail. Hyde shows how these elements work in assembly, offering a deeper understanding of how high-level languages translate into machine code.\n\nAdvanced topics include optimization techniques, hardware interactions, and system-level programming. The book explores how assembly can be used to fine-tune performance-critical applications and interact directly with hardware components.\n\nThroughout, the emphasis is on clarity and practical application. The book includes numerous exercises, real-world examples, and detailed explanations, making it a valuable resource for anyone looking to master assembly language or gain deeper insights into computer operations."
  },
  {
    "id": "17a58b62-0258-45a5-8b8b-9a21a6d6630c",
    "title": "Seriously Good Software",
    "author": "Marco Faella",
    "genre": "Programming",
    "rating": 5,
    "coverUrl": "https://images.unsplash.com/photo-1610563166150-b34df4f3bcd6?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8c29mdHdhcmUlMjBkZXZlbG9wbWVudHxlbnwwfHwwfHx8MA%3D%3D",
    "coverColor": "#061e20",
    "description": "This book is perfect for developers who want to elevate their coding skills beyond functionality, making their work robust and professional. Written in an accessible style, Seriously Good Software bridges the gap between theoretical principles and practical application.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://www.youtube.com/watch?v=4gwYkEK0gOk",
    "summary": "Seriously Good Software starts by exploring the core principles of software development, emphasizing the importance of correctness—software must function as intended under all specified conditions. Faella uses clear examples to show how to identify and fix errors that might compromise the correctness of code.\n\nThe book progresses to readability, highlighting how clean, well-documented code improves collaboration and reduces maintenance costs. Developers learn techniques to refactor code for better readability without compromising functionality.\n\nPerformance and scalability are addressed with practical tips on optimizing code to handle increasing workloads and adapt to growth. Faella explains how to use profiling tools, optimize algorithms, and make trade-offs to enhance efficiency.\n\nSecurity is another key focus, with the book covering techniques to protect software from vulnerabilities and potential attacks. Maintainability rounds out the discussion, teaching developers how to write modular, testable code that adapts to future changes.\n\nThroughout, Seriously Good Software balances theory with hands-on examples, encouraging developers to apply best practices in their projects. With its emphasis on professionalism and long-term thinking, the book equips readers to create software that not only works but thrives."
  }
]
